<a href="https://colab.research.google.com/github/coder20910/Movie-Recommendation-System/blob/master/Move.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Movie Recommendation System (Content Based)

# Importing Libraries

In [ ]:
import numpy as np
import pandas as pd
import warnings

# Ignoring Warnings

In [ ]:
warnings.filterwarnings('ignore')

# Getting the dataset

In [ ]:
column_names = ["user_id","item_id","rating","timestamp"]  # Changing the column name of the file

# Reading the set master dataset

df = pd.read_csv('u.data', sep='\t', names=column_names)    # Though this is a not csv file 
                                                            # so we are using separator by which data is sepearated (Tab)

In [ ]:
df.head()

   user_id  item_id  rating  timestamp
0      196      242       3  881250949
1      186      302       3  891717742
2       22      377       1  878887116
3      244       51       2  880606923
4      166      346       1  886397596

In [ ]:
df['user_id'].nunique()     # It will return the count of unique user's of the dataset

943

In [ ]:
df['item_id'].nunique()        # It will return the count of unique movies of the dataset

1682

In [ ]:
# Reading the movies dataset
movies_titles = pd.read_csv('u.item',sep='\|',header= None)

In [ ]:
movies_titles = movies_titles[[0,1]]  #

In [ ]:
movies_titles.columns = ['item_id','title']     # Assinging the name of the movie_id and movie_title

In [ ]:
movies_titles.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [ ]:
# Merging the dataset
df = pd.merge(df,movies_titles,on="item_id")       # on specifies the column name which have to merge

In [ ]:
df.tail()

       user_id  item_id  rating  timestamp
99995      880      476       3  880175444
99996      716      204       5  879795543
99997      276     1090       1  874795795
99998       13      225       2  882399156
99999       12      203       3  879959583

# Exploratry Data Analysis

In [ ]:
import matplotlib.pyplot as plt 
import seaborn as sns
sns.set_style('white')

In [ ]:
df.groupby('title').mean()['rating'].sort_values(ascending=False) # It will sort moveis in the descending order on the basis of 'rating'.

title
Marlene Dietrich: Shadow and Light (1996)       5.0
Prefontaine (1997)                              5.0
Santa with Muscles (1996)                       5.0
Star Kid (1997)                                 5.0
Someone Else's America (1995)                   5.0
                                               ...
Touki Bouki (Journey of the Hyena) (1973)       1.0
JLG/JLG - autoportrait de d�cembre (1994)       1.0
Daens (1992)                                    1.0
Butterfly Kiss (1995)                           1.0
Eye of Vichy, The (Oeil de Vichy, L') (1993)    1.0
Name: rating, Length: 1664, dtype: float64